- Name : Dr Muhammad Adeel Munir
- LinkedIn : https://www.linkedin.com/in/muhammad-adeel-munir-b0652b206/
- Youtube :https://www.youtube.com/channel/UCwtgli4m7P0sxmohM-Xag5A

# Titanic Dataset prediction by survival rate

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import plotly.express as px

In [8]:
# Import data from D:\Drive D\One drive folder\OneDrive - Higher Education Commission\Drive G\Data science coding\Data sets

df_train=pd.read_csv('D:/Drive D/One drive folder/OneDrive - Higher Education Commission/Drive G/Data science coding/Data sets/train.csv')
df_test=pd.read_csv('D:/Drive D/One drive folder/OneDrive - Higher Education Commission/Drive G/Data science coding/Data sets/test.csv')
submission=pd.read_csv('D:/Drive D/One drive folder/OneDrive - Higher Education Commission/Drive G/Data science coding/Data sets/gender_submission.csv')

In [9]:
df_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [10]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [11]:
submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1